tutorials/combustion/dieselFoam/aachenBomb/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Cmix            Cmix [ 0 0 0 0 0 0 0 ] 1;

ignitionProperties1
{
    ignite          on;
    ignitionPoint   ignitionPoint [ 0 1 0 0 0 0 0 ] ( 0.2 0 0.02 );
    timing          timing [ 0 0 1 0 0 0 0 ] 0;
    duration        duration [ 0 0 1 0 0 0 0 ] 1;
}


// ************************************************************************* //
